app/Config/LoginCustomer.php

SELECT *
FROM `customers`
WHERE `id` = '2'
 LIMIT 1
---
    public function __construct()
    {
        $this->session = \Config\Services::session();
        $this->customerModel = new \App\Models\CustomerModel();

        if (session()->get('customer_id') != NULL) {
            $customer = $this->customerModel->where("id", session()->get('customer_id'))->first();