app/Config/Login.php

    public function __construct()
    {
        $this->session = \Config\Services::session();
        $this->adminModel = new \App\Models\AdministratorModel();

        if (session()->get('admin_id') != NULL) {
            $admin = $this->adminModel->where("id", session()->get('admin_id'))->first();
---
SELECT *
FROM `administrators`
WHERE `id` = '2'
 LIMIT 1