app/Controllers/AdminCategoryController.php

    public function admin_category()
    {
        $data = [
            'categories' => $this->categoryModel->findAll(),
            'validation' => \Config\Services::validation(),
        ];
---
SELECT *
FROM `categories`

    public function admin_category_add_process()
    {
        if (!$this->validate([
            'name'      => [
                'rules' => 'is_unique[categories.name]',
                'errors' => [
                    'is_unique' => 'Nama kategori produk sudah ada',
                ],
            ],
        ])) {
            $validation = \Config\Services::validation();
            return redirect()->to(base_url('/eshop-admin/categories'))->withInput()->with('validation', $validation);
        }

        $name = $this->request->getPost("name");

        $this->categoryModel->insert([
            "name"          => $name,
        ]);
---
INSERT INTO `categories` (`name`) VALUES ('asd')

    public function admin_category_view_edit($id)
    {
        $data = [
            'category' => $this->categoryModel->find($id),
        ];
---
SELECT *
FROM `categories`
WHERE `categories`.`id` = '1'