app/Controllers/AdminProductController.php

    public function admin_product()
    {
        $products = $this->productModel
            ->join('categories', 'products.category_id = categories.id', 'left')
            ->select(
                'products.id,
                products.slug,
                products.title,
                products.category_id,
                products.content,
                categories.name as category_name,'
            )
            ->orderBy('products.title')
            ->get()
            ->getResultObject();
---
SELECT `products`.`id`, `products`.`slug`, `products`.`title`, `products`.`category_id`, `products`.`content`, `categories`.`name` as `category_name`
FROM `products`
LEFT JOIN `categories` ON `products`.`category_id` = `categories`.`id`
ORDER BY `products`.`title`

    public function admin_products_edit_process()
    {
        $id = $this->request->getPost('id');
        $name = $this->request->getPost('title');
        $category = $this->request->getPost('category');
        $content = $this->request->getPost('content');

        $names = explode(" ", $name);
        $slug = implode('-', $names);
        $dataTitleSama = $this->productModel->where(['title' => $name, 'id !=' => $id])->first();
        $rule = 'required';
        if ($dataTitleSama) {
            $rule = 'is_unique[products.title]';
        }
        if (!$this->validate([
            'title'      => [
                'title' => $rule,
                'errors' => [
                    'is_unique' => 'Nama produk sudah ada',
                ],
            ],
        ])) {
            $validation = \Config\Services::validation();
            return redirect()->to(base_url("eshop-admin/products/view_edit/$id"))->withInput()->with('validation', $validation);
        }

        $this->productModel->set([
            "title"          => $name,
            "slug"          => strtolower($slug),
            "category_id"          => $category,
            "content"          => $content,
        ])->where('id', $id)->update();
---
SELECT *
FROM `products`
WHERE `title` = 'Cadar'
AND `id` != '23'
 LIMIT 1
UPDATE `products` SET `title` = 'Cadar', `slug` = 'cadar', `category_id` = '1', `content` = '<div>qwe</div>'
WHERE `id` = '23'

            $image = $this->request->getFile("image_edit_$i");
            if (is_uploaded_file($image)) {
                $namePicture = $image->getRandomName();
                $nameOldImage = $this->productImageModel->where('id', $Idimage)->first();
                unlink('product_images/' . $nameOldImage->product_image);
                $image->move(ROOTPATH . 'public/product_images', $namePicture);
                $this->productImageModel->set([
                    'product_image' => $namePicture,
                ])->where('id', $Idimage)->update();
---
SELECT *
FROM `product_images`
WHERE `id` = '18'
 LIMIT 1
UPDATE `product_images` SET `product_image` = '1678442926_4bbd2a365ac5e737be3b.jpg'
WHERE `id` = '18'

    public function admin_product_variants($productId)
    {
        $data = [
            'product_variants' => $this->productVariantModel->where('product_id', $productId)->findAll(),
            'productId' => $productId,
            'validation' => \Config\Services::validation(),
        ];
---
SELECT *
FROM `product_variants`
WHERE `product_id` = '25'

    public function admin_product_variants_delete($id, $productId)
    {
        $productVariantData = $this->productVariantModel->find($id);
        $productInCart = $this->cartModel->where('product_variant_id', $id)->first();
        $productInOrder = $this->OrderModel->where('product_variant_id', $id)->first();
        if ($productInCart && $productInOrder) {
            session()->setFlashdata('msg_status', 'warning');
            session()->setFlashdata('msg', "Produk gagal dihapus karena sudah terpakai");
            return redirect()->to(base_url("eshop-admin/products"));
        }
        $this->productVariantModel->where('id', $id)->delete();
---
SELECT *
FROM `product_variants`
WHERE `product_variants`.`id` = '1'
SELECT *
FROM `carts`
WHERE `product_variant_id` = '1'
 LIMIT 1
SELECT *
FROM `orders`
WHERE `product_variant_id` = '1'
 LIMIT 1
DELETE FROM `product_variants`
WHERE `id` = '1'