app/Controllers/CustomerAccountController.php

SELECT *
FROM `customers`
WHERE `id` = '1'
 LIMIT 1
---
    public function customer_accounts_view_edit($id)
    {
        $data = [
            'validation' => \Config\Services::validation(),
            'dataAccount' => $this->customerModel->where("id", $id)->first(),