app/Controllers/CustomerController.php

SELECT *
FROM `products`
 LIMIT 5
---
    public function home()
    {
        // echo "test";
        $data = [
            'products' => $this->productModel->findAll(5),
            'product_variants' => $this->productVariantModel,
            'db' => $this->db,
        ];

INSERT INTO `customers` (`name`, `address`, `phone`, `email`, `password`) VALUES ('Hisyam Abilkhoir', 'as', '123', 'hisamabilkhoir99@gmail.com', '$2y$10$hiRartVI4P2xBspEsm3hQe8cbmFJm8utwn2f2iPyipHN3Et82XFH.')
---
            "active"                    => 1,
        ]);

        $this->customerModel->insert($dataInsert);

SELECT *
FROM `categories`
ORDER BY `name` ASC
SELECT *
FROM `products`
---
    public function products()
    {
        $data = [
            'categories' => $this->categoryModel->orderBy('name', 'asc')->findAll(),
            'products' => $this->productModel->findAll(),
            'product_variants' => $this->productVariantModel,
            'productModel' => $this->productModel,
            'db' => $this->db,
        ];

SELECT *
FROM `product_variants`
WHERE `product_id` = '24'
SELECT *
FROM `product_images`
WHERE `product_id` = '24'
SELECT *
FROM `products`
WHERE `slug` = 'wollycrep-premium---hitam-ungu'
 LIMIT 1
---
    public function product_detail($slug)
    {
        $product = $this->productModel->where('slug', $slug)->first();

        $data = [
            'db'    => $this->db,
            'products_mores' => $this->productModel->where('id !=', $product->id)->findAll(4),
            'product' => $product,
            'product_images' => $this->productImageModel->where('product_id', $product->id)->findAll(),
            'product_variants' => $this->productVariantModel->where('product_id', $product->id)->findAll(),
            'productVariantModel' => $this->productVariantModel,
        ];

SELECT *
FROM `carts`
WHERE `product_variant_id` = '4'
AND `customer_id` = '5'
 LIMIT 1
SELECT *
FROM `product_variants`
WHERE `id` = '4'
 LIMIT 1
---
    public function add_to_cart()
    {
        if (session()->get('customer_id') == null) {
            return redirect('eshop-customer');
        }

        $product_variant_id = $this->request->getPost('product_variant_id');
        $quantity = $this->request->getPost('quantity');

        $cart = $this->cartModel->where('product_variant_id', $product_variant_id)->where('customer_id', session()->get('customer_id'))->first();
        $data_product_variant = $this->productVariantModel->where('id', $product_variant_id)->first();

INSERT INTO `carts` (`product_id`, `product_variant_id`, `customer_id`, `quantity`, `price`, `weight`) VALUES ('25', '4', '5', '1', '1000', '100')
---
                "weight"                => $data_product_variant->weight,
            ]);

            $this->cartModel->insert($dataInsert);

SELECT *
FROM `carts`
WHERE `customer_id` = '2'
---
    public function checkout()
    {
        $curl = curl_init();

        curl_setopt_array($curl, array(
            CURLOPT_URL => "http://api.rajaongkir.com/starter/province",
            CURLOPT_RETURNTRANSFER => true,
            CURLOPT_ENCODING => "",
            CURLOPT_MAXREDIRS => 10,
            CURLOPT_TIMEOUT => 30,
            CURLOPT_HTTP_VERSION => CURL_HTTP_VERSION_1_1,
            CURLOPT_CUSTOMREQUEST => "GET",
            CURLOPT_HTTPHEADER => array(
                "key: " . config("App")->apiKey
            ),
        ));

        $response = curl_exec($curl);
        $err = curl_error($curl);

        curl_close($curl);
        $carts = $this->cartModel->where('customer_id', session()->get('customer_id'))->findAll();

INSERT INTO `invoices` (`invoice`, `customer_id`, `courier`, `service`, `cost_courier`, `weight`, `name`, `order_date`, `phone`, `province`, `city`, `address`, `status`, `grand_total`) VALUES ('INV - KPEXU2OMRT', '16', 'jne', 'REG', '29000', '200', 'Hisyam Abilkhoir', '23-04-09', '085973729267', 'Bali', 'Kabupaten Bangli', 'Jln. Pahlawan, Desa Dawuan, Kec. Tengah Tani, Kab. Cirebon', 'pending', 31000)
SELECT *
FROM `invoices`
WHERE `id` = 14
 LIMIT 1
SELECT `carts`.`product_id`, `carts`.`product_variant_id`, `carts`.`quantity`, `carts`.`price`, `products`.`title`, `product_variants`.`size`
FROM `carts`
JOIN `products` ON `carts`.`product_id` = `products`.`id`
JOIN `product_variants` ON `carts`.`product_variant_id` = `product_variants`.`id`
WHERE `carts`.`customer_id` = '16'
INSERT INTO `orders` (`invoice_id`, `product_id`, `product_variant_id`, `product_name`, `variant_name`, `qty`, `price`) VALUES ('14', '25', '4', 'Wollycrep Premium - Hitam Biru', 'L', '2', '1000')
---

        $no_invoice = 'INV - ' . strtoupper(random_string('alnum', 10));

        $invoice = $this->invoiceModel->insert([
            'invoice'       => $no_invoice,
            'customer_id'          => session()->get('customer_id'),
            'courier'          => $courier,
            'service'          => $service,
            'cost_courier'          => $cost,
            'weight'          => $weight,
            'name'          => $name,
            'order_date'          => date('y-m-d'),
            'phone'         => $phone,
            'province'         => $province,
            'city'         => $city,
            'address'       => $address,
            'status'        => 'pending',
            'grand_total'   => $grand_total + $cost,
        ]);
        $invoice = $this->invoiceModel->where('id', $invoice)->first();
        $carts = $this->cartModel
            ->select([
                'carts.product_id',
                'carts.product_variant_id',
                'carts.quantity',
                'carts.price',
                'products.title',
                'product_variants.size',
            ])
            ->join('products', 'carts.product_id = products.id')
            ->join('product_variants', 'carts.product_variant_id = product_variants.id')
            ->where('carts.customer_id', session()->get('customer_id'))
            ->findAll();
        foreach ($carts as $cart) {
            //insert product ke table order
            $this->orderModel->insert([
                'invoice_id'    => $invoice->id,
                'product_id'    => $cart->product_id,
                'product_variant_id'    => $cart->product_variant_id,
                'product_name'  => $cart->title,
                'variant_name'  => $cart->size,
                'qty'           => $cart->quantity,
                'price'         => $cart->price,
            ]);

UPDATE `invoices` SET `snap_token` = '04eb521d-9c91-4c55-a363-806f963fe4df'
WHERE `invoices`.`id` IN ('14')
DELETE FROM `carts`
WHERE `customer_id` = '16'
---

        //create snap token
        $snapToken = Snap::getSnapToken($payload);
        $this->invoiceModel->update($invoice->id, ['snap_token' => $snapToken]);
        $this->cartModel->where('customer_id', session()->get('customer_id'))->delete();

SELECT *
FROM `product_images`
WHERE `product_id` IN ('26')
SELECT `product_id`
FROM `orders`
WHERE `invoice_id` = '14'
SELECT *
FROM `invoices`
WHERE `snap_token` = '03972b9a-b1cb-4212-b173-f92740de87ba'
 LIMIT 1
---
    public function order_history($snapToken)
    {
        $invoice = $this->invoiceModel->where('snap_token', $snapToken)->first();
        $productsId = $this->orderModel->where('invoice_id', $invoice->id)->findColumn('product_id');
        $products = $this->orderModel->where('invoice_id', $invoice->id)->whereIn('product_id', $productsId)->get()->getResultObject();
        $productImages = $this->productImageModel->whereIn('product_id', $productsId)->get()->getResultObject();
        foreach ($products as $key => $value) {
            $i = 0;
            while ($i < count($productImages)) {
                if ($productImages[$i]->product_id == $value->product_id) {
                    $value->product_images[$i] = $productImages[$i]->product_image;
                }
                $i++;
            }
        }
        $data = [
            'invoice' => $this->invoiceModel->where('snap_token', $snapToken)->first(),
            'products' => $products,
        ];