app/Views/customer/product.php

                                <div class="tab-single">
                                    <div class="row">
                                        <?php
                                        $by_category = $productModel->where('category_id', $category->id)->findAll();
---
SELECT *
FROM `products`
WHERE `category_id` = '2'