app/Views/customer/product_detail.php

SELECT MAX(`discount`) AS `discount`
FROM `product_variants`
WHERE `product_id` = '25'
 LIMIT 1
---
                $data_product_image = $product_image->getFirstRow();


                $string_discount = $productVariantModel->where('product_id', $product->id)->selectMax('discount')->first();