app/Views/customer/template.php

SELECT *
FROM `carts`
WHERE `customer_id` = '20'
---
                                if (session()->get('customer_id')) {
                                    $this->cartModel = new \App\Models\CartModel();

                                    $cart = $this->cartModel->where('customer_id', session()->get('customer_id'))->findAll();